**Series**

In [2]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
a=[1,7,2]
myvar=pd.Series(a,index=["x","y","z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [6]:
print("series>25=\n",series>25)
series_filtered=series[series>25]
print("Filtered Series:\n",series_filtered)

series>25=
 0    False
1    False
2     True
3     True
4     True
dtype: bool
Filtered Series:
 2    30
3    40
4    50
dtype: int64

In [8]:
#Using numpy functions
import numpy as np
print("series_sqrt=\n",np.sqrt(series))

series_sqrt=
 0    3.162278
1    4.472136
2    5.477226
3    6.324555
4    7.071068
dtype: float64

**DataFrame**

In [9]:
data={"calories":[420,380,390],"duration":[50,40,45]}
df=pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [10]:
data={"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
      "year":[2000,2001,2002,2001,2002,2003],
      "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
print(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [13]:
#changing the order of the columns
frame = pd.DataFrame(data,columns=["year","state","pop"])
print(frame)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [14]:
#pass a column 'debt' that is not in the dictionary
frame2=pd.DataFrame(data,columns=["year","state","pop","debt"],index=["one","two","three","four","five","six"])
print(frame2)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [15]:
print(frame2["year"])
print("\n",frame2["state"])
print("\n",frame2.state)

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

 one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

 one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [16]:
#Using arange() function
frame2['debt']=np.arange(6.)
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [17]:
val=pd.Series([-1.2,-1.5,-1.7],index=["two","four","five"])
frame2['debt']=val
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [18]:
print(frame2.T)

        one   two three    four    five     six
year   2000  2001  2002    2001    2002    2003
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
debt    NaN  -1.2   NaN    -1.5    -1.7     NaN

**Reindexing**

In [19]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
print(obj)
obj2=obj.reindex(['a','b','c','d','e'])
obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

**Interpolation or filling**

In [20]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
print(obj3)
obj4=obj3.reindex(range(6),method='ffill')
obj4

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [21]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj4=obj3.reindex(range(6),method='ffill')
print("Method 'ffill':")
obj4

Method 'ffill':

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

**Indexing,Selection, and Filtering**

In [27]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])
print("obj['b']=\n",obj['b'])
print("obj[1]=\n",obj[1])
print("obj[2:4]=\n",obj[2:4])

obj['b']=
 1.0

<ipython-input-27-e85439345365>:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print("obj[1]=\n",obj[1])

obj[1]=
 1.0
obj[2:4]=
 c    2.0
d    3.0
dtype: float64

In [28]:
data=pd.DataFrame(np.arange(24).reshape((6,4)),
                  index=['Ohio','Dallas','Boston','NJ','NewYork','Austin'],
                  columns=['one','two','three','four'])
data

         one  two  three  four
Ohio       0    1      2     3
Dallas     4    5      6     7
Boston     8    9     10    11
NJ        12   13     14    15
NewYork   16   17     18    19
Austin    20   21     22    23

In [29]:
data['two']

Ohio        1
Dallas      5
Boston      9
NJ         13
NewYork    17
Austin     21
Name: two, dtype: int32

In [30]:
data[1:5]

         one  two  three  four
Dallas     4    5      6     7
Boston     8    9     10    11
NJ        12   13     14    15
NewYork   16   17     18    19

**Arithmetic and Data Alingment**

In [31]:
df1=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
df2=pd.DataFrame({'A':[7,8,9],'B':[10,11,12]})
print(df1)
print(df2)
print("Addition:\n",df1+df2)
print("Subraction:\n",df1-df2)
print("Multiplication:\n",df1*df2)
print("Divison:\n",df1/df2)

   A  B
0  1  4
1  2  5
2  3  6
   A   B
0  7  10
1  8  11
2  9  12
Addition:
     A   B
0   8  14
1  10  16
2  12  18
Subraction:
    A  B
0 -6 -6
1 -6 -6
2 -6 -6
Multiplication:
     A   B
0   7  40
1  16  55
2  27  72
Divison:
           A         B
0  0.142857  0.400000
1  0.250000  0.454545
2  0.333333  0.500000

**Sorting and Ranking**

In [32]:
obj=pd.Series(range(4),index=['d','a','b','c'])
df_sort_series=obj.sort_index()
print(df_sort_series)
frame = pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],
                     columns=['d','a','b','c'])
print("I\n",frame.sort_index())
print("II\n",frame.sort_index(axis=1))
print("III\n",frame.sort_index(axis=1,ascending=False))
print("IV\n",frame.sort_values(by='b'))

a    1
b    2
c    3
d    0
dtype: int64
I
        d  a  b  c
one    4  5  6  7
three  0  1  2  3
II
        a  b  c  d
three  1  2  3  0
one    5  6  7  4
III
        d  c  b  a
three  0  3  2  1
one    4  7  6  5
IV
        d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [33]:
obj=pd.Series([7,-5,7,3,2,0,4])
print("Rank\n",obj.rank())
print("rank-Method=first\n",obj.rank(method='first'))
print("rank-Method=max\n",obj.rank(ascending=False,method='max'))
frame=pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
print("Rank over rows\n",frame)
print("rank over columns \n",frame.rank(axis='columns'))

Rank
 0    6.5
1    1.0
2    6.5
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64
rank-Method=first
 0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64
rank-Method=max
 0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    3.0
dtype: float64
Rank over rows
      b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5
rank over columns
      b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0